espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/ahb_dma_reg.h
/** AHB_DMA_TX_CRC_DATA_EN_ADDR_CH0_REG register
 *  This register is used to config addr of crc data_8bit en
 */
#define AHB_DMA_TX_CRC_DATA_EN_ADDR_CH0_REG (DR_REG_AHB_DMA_BASE + 0x2d8)
/** AHB_DMA_TX_CRC_DATA_EN_ADDR_CH0 : R/W; bitpos: [31:0]; default: 0;
 *  reserved
 */
#define AHB_DMA_TX_CRC_DATA_EN_ADDR_CH0    0xFFFFFFFFU
#define AHB_DMA_TX_CRC_DATA_EN_ADDR_CH0_M  (AHB_DMA_TX_CRC_DATA_EN_ADDR_CH0_V << AHB_DMA_TX_CRC_DATA_EN_ADDR_CH0_S)
#define AHB_DMA_TX_CRC_DATA_EN_ADDR_CH0_V  0xFFFFFFFFU
#define AHB_DMA_TX_CRC_DATA_EN_ADDR_CH0_S  0

/** AHB_DMA_TX_CH_ARB_WEIGH_CH0_REG register
 *  TX channel 0 arbitration weight configuration register
 */
#define AHB_DMA_TX_CH_ARB_WEIGH_CH0_REG (DR_REG_AHB_DMA_BASE + 0x2dc)
/** AHB_DMA_TX_ARB_WEIGHT_VALUE_CH0 : R/W; bitpos: [3:0]; default: 0;
 *  Configures the weight(i.e the number of tokens) of TX channel0
 */
#define AHB_DMA_TX_ARB_WEIGHT_VALUE_CH0    0x0000000FU
#define AHB_DMA_TX_ARB_WEIGHT_VALUE_CH0_M  (AHB_DMA_TX_ARB_WEIGHT_VALUE_CH0_V << AHB_DMA_TX_ARB_WEIGHT_VALUE_CH0_S)
#define AHB_DMA_TX_ARB_WEIGHT_VALUE_CH0_V  0x0000000FU
#define AHB_DMA_TX_ARB_WEIGHT_VALUE_CH0_S  0

/** AHB_DMA_TX_ARB_WEIGHT_OPT_DIR_CH0_REG register
 *  TX channel 0 weight arbitration optimization enable register
 */
#define AHB_DMA_TX_ARB_WEIGHT_OPT_DIR_CH0_REG (DR_REG_AHB_DMA_BASE + 0x2e0)
/** AHB_DMA_TX_ARB_WEIGHT_OPT_DIS_CH0 : R/W; bitpos: [0]; default: 0;
 *  reserved
 */
#define AHB_DMA_TX_ARB_WEIGHT_OPT_DIS_CH0    (BIT(0))
#define AHB_DMA_TX_ARB_WEIGHT_OPT_DIS_CH0_M  (AHB_DMA_TX_ARB_WEIGHT_OPT_DIS_CH0_V << AHB_DMA_TX_ARB_WEIGHT_OPT_DIS_CH0_S)
#define AHB_DMA_TX_ARB_WEIGHT_OPT_DIS_CH0_V  0x00000001U
#define AHB_DMA_TX_ARB_WEIGHT_OPT_DIS_CH0_S  0

/** AHB_DMA_OUT_CRC_INIT_DATA_CH1_REG register
 *  This register is used to config ch1 crc initial data(max 32 bit)
 */
#define AHB_DMA_OUT_CRC_INIT_DATA_CH1_REG (DR_REG_AHB_DMA_BASE + 0x2e4)
/** AHB_DMA_OUT_CRC_INIT_DATA_CH1 : R/W; bitpos: [31:0]; default: 4294967295;
 *  This register is used to config ch0 of tx crc initial value
 */
#define AHB_DMA_OUT_CRC_INIT_DATA_CH1    0xFFFFFFFFU
#define AHB_DMA_OUT_CRC_INIT_DATA_CH1_M  (AHB_DMA_OUT_CRC_INIT_DATA_CH1_V << AHB_DMA_OUT_CRC_INIT_DATA_CH1_S)
#define AHB_DMA_OUT_CRC_INIT_DATA_CH1_V  0xFFFFFFFFU
#define AHB_DMA_OUT_CRC_INIT_DATA_CH1_S  0

/** AHB_DMA_TX_CRC_WIDTH_CH1_REG register
 *  This register is used to confiig tx ch1 crc result width,2'b00 mean crc_width
 *  <=8bit,2'b01 8<crc_width<=16 ,2'b10 mean 16<crc_width  <=24,2'b11 mean
 *  24<crc_width<=32
 */
#define AHB_DMA_TX_CRC_WIDTH_CH1_REG (DR_REG_AHB_DMA_BASE + 0x2e8)
/** AHB_DMA_TX_CRC_WIDTH_CH1 : R/W; bitpos: [1:0]; default: 0;
 *  reserved
 */
#define AHB_DMA_TX_CRC_WIDTH_CH1    0x00000003U
#define AHB_DMA_TX_CRC_WIDTH_CH1_M  (AHB_DMA_TX_CRC_WIDTH_CH1_V << AHB_DMA_TX_CRC_WIDTH_CH1_S)
#define AHB_DMA_TX_CRC_WIDTH_CH1_V  0x00000003U
#define AHB_DMA_TX_CRC_WIDTH_CH1_S  0
/** AHB_DMA_TX_CRC_LAUTCH_FLGA_CH1 : R/W; bitpos: [2]; default: 0;
 *  reserved
 */
#define AHB_DMA_TX_CRC_LAUTCH_FLGA_CH1    (BIT(2))
#define AHB_DMA_TX_CRC_LAUTCH_FLGA_CH1_M  (AHB_DMA_TX_CRC_LAUTCH_FLGA_CH1_V << AHB_DMA_TX_CRC_LAUTCH_FLGA_CH1_S)
#define AHB_DMA_TX_CRC_LAUTCH_FLGA_CH1_V  0x00000001U
#define AHB_DMA_TX_CRC_LAUTCH_FLGA_CH1_S  2

/** AHB_DMA_OUT_CRC_CLEAR_CH1_REG register
 *  This register is used to clear ch1 crc result
 */
#define AHB_DMA_OUT_CRC_CLEAR_CH1_REG (DR_REG_AHB_DMA_BASE + 0x2ec)
/** AHB_DMA_OUT_CRC_CLEAR_CH1 : R/W; bitpos: [0]; default: 0;
 *  This register is used to clear ch0 of tx crc result
 */
#define AHB_DMA_OUT_CRC_CLEAR_CH1    (BIT(0))
#define AHB_DMA_OUT_CRC_CLEAR_CH1_M  (AHB_DMA_OUT_CRC_CLEAR_CH1_V << AHB_DMA_OUT_CRC_CLEAR_CH1_S)
#define AHB_DMA_OUT_CRC_CLEAR_CH1_V  0x00000001U
#define AHB_DMA_OUT_CRC_CLEAR_CH1_S  0

/** AHB_DMA_OUT_CRC_FINAL_RESULT_CH1_REG register
 *  This register is used to store ch1 crc result
 */
#define AHB_DMA_OUT_CRC_FINAL_RESULT_CH1_REG (DR_REG_AHB_DMA_BASE + 0x2f0)
/** AHB_DMA_OUT_CRC_FINAL_RESULT_CH1 : RO; bitpos: [31:0]; default: 0;
 *  This register is used to store result ch0 of tx
 */
#define AHB_DMA_OUT_CRC_FINAL_RESULT_CH1    0xFFFFFFFFU
#define AHB_DMA_OUT_CRC_FINAL_RESULT_CH1_M  (AHB_DMA_OUT_CRC_FINAL_RESULT_CH1_V << AHB_DMA_OUT_CRC_FINAL_RESULT_CH1_S)
#define AHB_DMA_OUT_CRC_FINAL_RESULT_CH1_V  0xFFFFFFFFU
#define AHB_DMA_OUT_CRC_FINAL_RESULT_CH1_S  0

/** AHB_DMA_TX_CRC_EN_WR_DATA_CH1_REG register
 *  This resister is used to config ch1 crc en for every bit
 */
#define AHB_DMA_TX_CRC_EN_WR_DATA_CH1_REG (DR_REG_AHB_DMA_BASE + 0x2f4)
/** AHB_DMA_TX_CRC_EN_WR_DATA_CH1 : R/W; bitpos: [31:0]; default: 0;
 *  This register is used to enable tx ch0 crc 32bit on/off
 */
#define AHB_DMA_TX_CRC_EN_WR_DATA_CH1    0xFFFFFFFFU
#define AHB_DMA_TX_CRC_EN_WR_DATA_CH1_M  (AHB_DMA_TX_CRC_EN_WR_DATA_CH1_V << AHB_DMA_TX_CRC_EN_WR_DATA_CH1_S)
#define AHB_DMA_TX_CRC_EN_WR_DATA_CH1_V  0xFFFFFFFFU
#define AHB_DMA_TX_CRC_EN_WR_DATA_CH1_S  0

/** AHB_DMA_TX_CRC_EN_ADDR_CH1_REG register
 *  This register is used to config ch1 crc en addr
 */
#define AHB_DMA_TX_CRC_EN_ADDR_CH1_REG (DR_REG_AHB_DMA_BASE + 0x2f8)
/** AHB_DMA_TX_CRC_EN_ADDR_CH1 : R/W; bitpos: [31:0]; default: 0;
 *  reserved
 */
#define AHB_DMA_TX_CRC_EN_ADDR_CH1    0xFFFFFFFFU
#define AHB_DMA_TX_CRC_EN_ADDR_CH1_M  (AHB_DMA_TX_CRC_EN_ADDR_CH1_V << AHB_DMA_TX_CRC_EN_ADDR_CH1_S)
#define AHB_DMA_TX_CRC_EN_ADDR_CH1_V  0xFFFFFFFFU
#define AHB_DMA_TX_CRC_EN_ADDR_CH1_S  0

/** AHB_DMA_TX_CRC_DATA_EN_WR_DATA_CH1_REG register
 *  This register is used to config crc data_8bit en
 */
#define AHB_DMA_TX_CRC_DATA_EN_WR_DATA_CH1_REG (DR_REG_AHB_DMA_BASE + 0x2fc)
/** AHB_DMA_TX_CRC_DATA_EN_WR_DATA_CH1 : R/W; bitpos: [7:0]; default: 0;
 *  reserved
 */
#define AHB_DMA_TX_CRC_DATA_EN_WR_DATA_CH1    0x000000FFU
#define AHB_DMA_TX_CRC_DATA_EN_WR_DATA_CH1_M  (AHB_DMA_TX_CRC_DATA_EN_WR_DATA_CH1_V << AHB_DMA_TX_CRC_DATA_EN_WR_DATA_CH1_S)
#define AHB_DMA_TX_CRC_DATA_EN_WR_DATA_CH1_V  0x000000FFU
#define AHB_DMA_TX_CRC_DATA_EN_WR_DATA_CH1_S  0

/** AHB_DMA_TX_CRC_DATA_EN_ADDR_CH1_REG register
 *  This register is used to config addr of crc data_8bit en
 */
#define AHB_DMA_TX_CRC_DATA_EN_ADDR_CH1_REG (DR_REG_AHB_DMA_BASE + 0x300)
/** AHB_DMA_TX_CRC_DATA_EN_ADDR_CH1 : R/W; bitpos: [31:0]; default: 0;
 *  reserved
 */
#define AHB_DMA_TX_CRC_DATA_EN_ADDR_CH1    0xFFFFFFFFU
#define AHB_DMA_TX_CRC_DATA_EN_ADDR_CH1_M  (AHB_DMA_TX_CRC_DATA_EN_ADDR_CH1_V << AHB_DMA_TX_CRC_DATA_EN_ADDR_CH1_S)
#define AHB_DMA_TX_CRC_DATA_EN_ADDR_CH1_V  0xFFFFFFFFU
#define AHB_DMA_TX_CRC_DATA_EN_ADDR_CH1_S  0

