espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/ahb_dma_reg.h
/** AHB_DMA_IN_CRC_INIT_DATA_CH1_REG register
 *  This register is used to config ch1 crc initial data(max 32 bit)
 */
#define AHB_DMA_IN_CRC_INIT_DATA_CH1_REG (DR_REG_AHB_DMA_BASE + 0x35c)
/** AHB_DMA_IN_CRC_INIT_DATA_CH1 : R/W; bitpos: [31:0]; default: 4294967295;
 *  This register is used to config ch0 of rx crc initial value
 */
#define AHB_DMA_IN_CRC_INIT_DATA_CH1    0xFFFFFFFFU
#define AHB_DMA_IN_CRC_INIT_DATA_CH1_M  (AHB_DMA_IN_CRC_INIT_DATA_CH1_V << AHB_DMA_IN_CRC_INIT_DATA_CH1_S)
#define AHB_DMA_IN_CRC_INIT_DATA_CH1_V  0xFFFFFFFFU
#define AHB_DMA_IN_CRC_INIT_DATA_CH1_S  0

/** AHB_DMA_RX_CRC_WIDTH_CH1_REG register
 *  This register is used to confiig rx ch1 crc result width,2'b00 mean crc_width
 *  <=8bit,2'b01 8<crc_width<=16 ,2'b10 mean 16<crc_width  <=24,2'b11 mean
 *  24<crc_width<=32
 */
#define AHB_DMA_RX_CRC_WIDTH_CH1_REG (DR_REG_AHB_DMA_BASE + 0x360)
/** AHB_DMA_RX_CRC_WIDTH_CH1 : R/W; bitpos: [1:0]; default: 0;
 *  reserved
 */
#define AHB_DMA_RX_CRC_WIDTH_CH1    0x00000003U
#define AHB_DMA_RX_CRC_WIDTH_CH1_M  (AHB_DMA_RX_CRC_WIDTH_CH1_V << AHB_DMA_RX_CRC_WIDTH_CH1_S)
#define AHB_DMA_RX_CRC_WIDTH_CH1_V  0x00000003U
#define AHB_DMA_RX_CRC_WIDTH_CH1_S  0
/** AHB_DMA_RX_CRC_LAUTCH_FLGA_CH1 : R/W; bitpos: [2]; default: 0;
 *  reserved
 */
#define AHB_DMA_RX_CRC_LAUTCH_FLGA_CH1    (BIT(2))
#define AHB_DMA_RX_CRC_LAUTCH_FLGA_CH1_M  (AHB_DMA_RX_CRC_LAUTCH_FLGA_CH1_V << AHB_DMA_RX_CRC_LAUTCH_FLGA_CH1_S)
#define AHB_DMA_RX_CRC_LAUTCH_FLGA_CH1_V  0x00000001U
#define AHB_DMA_RX_CRC_LAUTCH_FLGA_CH1_S  2

/** AHB_DMA_IN_CRC_CLEAR_CH1_REG register
 *  This register is used to clear ch1 crc result
 */
#define AHB_DMA_IN_CRC_CLEAR_CH1_REG (DR_REG_AHB_DMA_BASE + 0x364)
/** AHB_DMA_IN_CRC_CLEAR_CH1 : R/W; bitpos: [0]; default: 0;
 *  This register is used to clear ch0 of rx crc result
 */
#define AHB_DMA_IN_CRC_CLEAR_CH1    (BIT(0))
#define AHB_DMA_IN_CRC_CLEAR_CH1_M  (AHB_DMA_IN_CRC_CLEAR_CH1_V << AHB_DMA_IN_CRC_CLEAR_CH1_S)
#define AHB_DMA_IN_CRC_CLEAR_CH1_V  0x00000001U
#define AHB_DMA_IN_CRC_CLEAR_CH1_S  0

/** AHB_DMA_IN_CRC_FINAL_RESULT_CH1_REG register
 *  This register is used to store ch1 crc result
 */
#define AHB_DMA_IN_CRC_FINAL_RESULT_CH1_REG (DR_REG_AHB_DMA_BASE + 0x368)
/** AHB_DMA_IN_CRC_FINAL_RESULT_CH1 : RO; bitpos: [31:0]; default: 0;
 *  This register is used to store result ch0 of rx
 */
#define AHB_DMA_IN_CRC_FINAL_RESULT_CH1    0xFFFFFFFFU
#define AHB_DMA_IN_CRC_FINAL_RESULT_CH1_M  (AHB_DMA_IN_CRC_FINAL_RESULT_CH1_V << AHB_DMA_IN_CRC_FINAL_RESULT_CH1_S)
#define AHB_DMA_IN_CRC_FINAL_RESULT_CH1_V  0xFFFFFFFFU
#define AHB_DMA_IN_CRC_FINAL_RESULT_CH1_S  0

/** AHB_DMA_RX_CRC_EN_WR_DATA_CH1_REG register
 *  This resister is used to config ch1 crc en for every bit
 */
#define AHB_DMA_RX_CRC_EN_WR_DATA_CH1_REG (DR_REG_AHB_DMA_BASE + 0x36c)
/** AHB_DMA_RX_CRC_EN_WR_DATA_CH1 : R/W; bitpos: [31:0]; default: 0;
 *  This register is used to enable rx ch0 crc 32bit on/off
 */
#define AHB_DMA_RX_CRC_EN_WR_DATA_CH1    0xFFFFFFFFU
#define AHB_DMA_RX_CRC_EN_WR_DATA_CH1_M  (AHB_DMA_RX_CRC_EN_WR_DATA_CH1_V << AHB_DMA_RX_CRC_EN_WR_DATA_CH1_S)
#define AHB_DMA_RX_CRC_EN_WR_DATA_CH1_V  0xFFFFFFFFU
#define AHB_DMA_RX_CRC_EN_WR_DATA_CH1_S  0

/** AHB_DMA_RX_CRC_EN_ADDR_CH1_REG register
 *  This register is used to config ch1 crc en addr
 */
#define AHB_DMA_RX_CRC_EN_ADDR_CH1_REG (DR_REG_AHB_DMA_BASE + 0x370)
/** AHB_DMA_RX_CRC_EN_ADDR_CH1 : R/W; bitpos: [31:0]; default: 0;
 *  reserved
 */
#define AHB_DMA_RX_CRC_EN_ADDR_CH1    0xFFFFFFFFU
#define AHB_DMA_RX_CRC_EN_ADDR_CH1_M  (AHB_DMA_RX_CRC_EN_ADDR_CH1_V << AHB_DMA_RX_CRC_EN_ADDR_CH1_S)
#define AHB_DMA_RX_CRC_EN_ADDR_CH1_V  0xFFFFFFFFU
#define AHB_DMA_RX_CRC_EN_ADDR_CH1_S  0

/** AHB_DMA_RX_CRC_DATA_EN_WR_DATA_CH1_REG register
 *  This register is used to config crc data_8bit en
 */
#define AHB_DMA_RX_CRC_DATA_EN_WR_DATA_CH1_REG (DR_REG_AHB_DMA_BASE + 0x374)
/** AHB_DMA_RX_CRC_DATA_EN_WR_DATA_CH1 : R/W; bitpos: [7:0]; default: 0;
 *  reserved
 */
#define AHB_DMA_RX_CRC_DATA_EN_WR_DATA_CH1    0x000000FFU
#define AHB_DMA_RX_CRC_DATA_EN_WR_DATA_CH1_M  (AHB_DMA_RX_CRC_DATA_EN_WR_DATA_CH1_V << AHB_DMA_RX_CRC_DATA_EN_WR_DATA_CH1_S)
#define AHB_DMA_RX_CRC_DATA_EN_WR_DATA_CH1_V  0x000000FFU
#define AHB_DMA_RX_CRC_DATA_EN_WR_DATA_CH1_S  0

/** AHB_DMA_RX_CRC_DATA_EN_ADDR_CH1_REG register
 *  This register is used to config addr of crc data_8bit en
 */
#define AHB_DMA_RX_CRC_DATA_EN_ADDR_CH1_REG (DR_REG_AHB_DMA_BASE + 0x378)
/** AHB_DMA_RX_CRC_DATA_EN_ADDR_CH1 : R/W; bitpos: [31:0]; default: 0;
 *  reserved
 */
#define AHB_DMA_RX_CRC_DATA_EN_ADDR_CH1    0xFFFFFFFFU
#define AHB_DMA_RX_CRC_DATA_EN_ADDR_CH1_M  (AHB_DMA_RX_CRC_DATA_EN_ADDR_CH1_V << AHB_DMA_RX_CRC_DATA_EN_ADDR_CH1_S)
#define AHB_DMA_RX_CRC_DATA_EN_ADDR_CH1_V  0xFFFFFFFFU
#define AHB_DMA_RX_CRC_DATA_EN_ADDR_CH1_S  0

/** AHB_DMA_RX_CH_ARB_WEIGH_CH1_REG register
 *  RX channel 1 arbitration weight configuration register
 */
#define AHB_DMA_RX_CH_ARB_WEIGH_CH1_REG (DR_REG_AHB_DMA_BASE + 0x37c)
/** AHB_DMA_RX_ARB_WEIGHT_VALUE_CH1 : R/W; bitpos: [3:0]; default: 0;
 *  Configures the weight(i.e the number of tokens) of RX channel1
 */
#define AHB_DMA_RX_ARB_WEIGHT_VALUE_CH1    0x0000000FU
#define AHB_DMA_RX_ARB_WEIGHT_VALUE_CH1_M  (AHB_DMA_RX_ARB_WEIGHT_VALUE_CH1_V << AHB_DMA_RX_ARB_WEIGHT_VALUE_CH1_S)
#define AHB_DMA_RX_ARB_WEIGHT_VALUE_CH1_V  0x0000000FU
#define AHB_DMA_RX_ARB_WEIGHT_VALUE_CH1_S  0

/** AHB_DMA_RX_ARB_WEIGHT_OPT_DIR_CH1_REG register
 *  RX channel 1 weight arbitration optimization enable register
 */
#define AHB_DMA_RX_ARB_WEIGHT_OPT_DIR_CH1_REG (DR_REG_AHB_DMA_BASE + 0x380)
/** AHB_DMA_RX_ARB_WEIGHT_OPT_DIS_CH1 : R/W; bitpos: [0]; default: 0;
 *  reserved
 */
#define AHB_DMA_RX_ARB_WEIGHT_OPT_DIS_CH1    (BIT(0))
#define AHB_DMA_RX_ARB_WEIGHT_OPT_DIS_CH1_M  (AHB_DMA_RX_ARB_WEIGHT_OPT_DIS_CH1_V << AHB_DMA_RX_ARB_WEIGHT_OPT_DIS_CH1_S)
#define AHB_DMA_RX_ARB_WEIGHT_OPT_DIS_CH1_V  0x00000001U
#define AHB_DMA_RX_ARB_WEIGHT_OPT_DIS_CH1_S  0

/** AHB_DMA_IN_CRC_INIT_DATA_CH2_REG register
 *  This register is used to config ch2 crc initial data(max 32 bit)
 */
#define AHB_DMA_IN_CRC_INIT_DATA_CH2_REG (DR_REG_AHB_DMA_BASE + 0x384)
/** AHB_DMA_IN_CRC_INIT_DATA_CH2 : R/W; bitpos: [31:0]; default: 4294967295;
 *  This register is used to config ch0 of rx crc initial value
 */
#define AHB_DMA_IN_CRC_INIT_DATA_CH2    0xFFFFFFFFU
#define AHB_DMA_IN_CRC_INIT_DATA_CH2_M  (AHB_DMA_IN_CRC_INIT_DATA_CH2_V << AHB_DMA_IN_CRC_INIT_DATA_CH2_S)
#define AHB_DMA_IN_CRC_INIT_DATA_CH2_V  0xFFFFFFFFU
#define AHB_DMA_IN_CRC_INIT_DATA_CH2_S  0

